// 单片机 6-14题 使用中断的形式
#include <reg51.h>
unsigned int Flag = 0; // 方式转变的 flag
void main()
{
    TMOD = 0x05; // 工作方式
    // 0x 代表他是16进制的数，05转成2进制就是101，就是计数方式，方式1
    TH0 = (65536 - 100) / 256; // 设置初值
    TL0 = (65536 - 100) % 256;
    // 因为此时是计数器，所以直接65536 - 脉冲数
    // / 是取的高8位，% 是取的低8位
    EA = 1;  // 开启中断
    ET0 = 1; // 开计数器0中断
    TR0 = 1; // 启动计数器0
    while (1)
        ; // 死循环，暂时没理解意思
}

// 定时器 0 中断的程序
void timer0() interrrupt 1
{
    TR0 = 0; // 关闭计数器
    if (Flag == 0)
    {
        // 判断为0的时候切换至定时模式
        TMOD = 0x01;
        TH0 = (65536 - 500) / 256;
        TL0 = (65536 - 500) % 256;
        // 定时器，所以这里需要计算出来为500
    }
    else
    {
        TMOD = 0x05; // 计数器
        TH0 = (65536 - 100) / 256;
        TL0 = (65536 - 100) % 256;
    }
    TR0 = 1;      // 启动计数器
    Flag = ~Flag; // 取反
}