// 第七章，涉及波特率
// 串口通信通过“串口调试助手”发送一个数据给 AT89C51，
// AT89C51 接收数据后在数码管上显示，并将该数据返发给“串口调试
// 助手”波特率为 9600，晶振为 11.0592MHz
// 查询方式，不使用中断
#include <reg51.h>
void main()
{
    TMOD = 0x20; // 定时器 1 工作方式 2, 0x20 = 0010 0000
    SM0 = 0;
    SM1 = 1;
    REN = 1;    // 串口允许接收
    PCON = 0;   // 不加倍
    TH1 = 0xfd; // 波特率9600对应的值
    // 即 9600 = ( 1 / 32 ) * ((11.0592MHz / 12) / (256 - TH1))
    TL1 = 0xfd;
    TR1 = 1; // 启动定时器 1
    while (1)
    {
        while (!RI); // 等待接收中断
        RI = 0;
        P1 = SBUF; // 在 P1 接受数据
        SBUF = P1; // 将 P1 的值发送出去
        while (!TI); // 等待发送中断
        TI = 0;
    }
}